trackyu-mobile-expo/load-tests/01-baseline-health.yml
config:
  target: https://staging.trackyugps.com
  http:
    timeout: 15
  phases:
    - name: warmup
      duration: 30
      arrivalRate: 5
    - name: palier_50
      duration: 60
      arrivalRate: 50
    - name: palier_200
      duration: 60
      arrivalRate: 200
    - name: palier_500
      duration: 60
      arrivalRate: 500
    - name: palier_1000
      duration: 60
      arrivalRate: 1000
    - name: palier_2000
      duration: 60
      arrivalRate: 2000
    - name: palier_2500
      duration: 60
      arrivalRate: 2500
  ensure:
    p95: 2000
    maxErrorRate: 5

scenarios:
  - name: health-check
    flow:
      - get:
          url: /api/health
          expect:
            - statusCode: 200